Revit 2026 API

# ControlledApplicationCities Property

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CitySet Cities { get; }
```
```vb
Public ReadOnly Property Cities As CitySet
	Get
```
```cpp
public:
property CitySet^ Cities {
	CitySet^ get ();
}
```
```fsharp
member Cities : CitySet with get
```

#### Property Value

CitySet

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace